{
  "projects": [
    {
      "id": 1,
      "name": "OneInbox",
      "subtitle": "Hub de Mensajería Omnicanal",
      "short_description": "Optimización de respuesta y conversión en ventas.",
      "description": "Plataforma diseñada para centralizar las consultas de Meta, Mercado Libre y TiendaNube en un solo panel operativo. El sistema organiza el flujo de mensajes para evitar la pérdida de oportunidades comerciales, logrando una gestión ágil que permite respuestas en tiempo real y mejora el posicionamiento en los canales de venta.",
      "challenge": "Centralizar la atención al cliente de múltiples plataformas (Meta, Mercado Libre, TiendaNube) en una sola interfaz, eliminando la pérdida de oportunidades de venta por falta de respuesta.",
      "solution": "Desarrollé una interfaz inspirada en la eficiencia de WhatsApp, unificando contactos en un listado inteligente con metadatos de origen y estado. Implementé una optimización técnica crítica mediante Redux Persist y useMemo, logrando una fluidez del 90% en la carga de grandes volúmenes de mensajes.",
      "impact": "El sistema no solo incrementó las ventas en un 70% al garantizar que ninguna consulta quede sin responder, sino que mejoró el posicionamiento en Mercado Libre gracias a la automatización de respuestas en horarios no operativos.",
      "technologies": [
        "Node.js",
        "Express",
        "PostgreSQL",
        "Sequelize",
        "Socket.IO",
        "JavaScript",
        "React",
        "Redux",
        "React Router",
        "Vite",
        "Tailwind CSS",
        "Axios",
        "Chart.js",
        "JWT",
        "Auth0",
        "SweetAlert2",
        "Cloudinary"
      ],
      "url": "https://oneinbox.vercel.app/",
      "github": "https://github.com/One-Inbox",
      "images": []
    },
    {
      "id": 2,
      "name": " Laboratorios Del Rio",
      "subtitle": "Software de Gestión de Fórmulas",
      "short_description": "Ingeniería de precisión y diseño de sistemas.",
      "description": "Software técnico para la digitalización y el control de procesos en la fabricación de productos químicos. El sistema integra una interfaz visual que simplifica tareas complejas de laboratorio, garantizando la precisión en cada fórmula y asegurando un entorno de trabajo ordenado, eficiente y libre de errores de carga manual.",
      "challenge": "Digitalizar procesos de laboratorio complejos donde el error humano en la creación de fórmulas puede ser crítico.",
      "solution": "Diseñé y desarrollé una interfaz de alta precisión que permite el reordenamiento de procesos mediante Drag & Drop, facilitando la edición de datos complejos en tiempo real. Creé una librería de componentes propia basada en Tailwind CSS (@apply), asegurando una coherencia visual total y una aceleración del 25% en el ciclo de desarrollo.",
      "impact": "Un producto con 'deuda visual cero', donde la arquitectura de información guía al operario de forma intuitiva, minimizando riesgos y profesionalizando la producción del laboratorio.",
      "technologies": [
        "PHP",
        "MySQL",
        "HTML5",
        "CSS3",
        "JavaScript",
        "React",
        "Redux",
        "React Router",
        "Vite",
        "Tailwind CSS",
        "Axios",
        "Dnd Kit",
        "SweetAlert2"
      ],
      "url": "https://delriosistemas.com/",
      "github": "proyecto privado",
      "images": []
    },
    {
      "id": 3,
      "name": "Avignon Store",
      "subtitle": "E-commerce de Indumentaria",
      "short_description": "Creatividad y performance sin saturación.",
      "description": "Tienda online personalizada que integra la identidad visual de una marca de moda con un funcionamiento técnico de alta performance. La plataforma ofrece una experiencia de navegación fluida y rápida, diseñada para que el proceso de compra sea simple, intuitivo y visualmente atractivo.",
      "challenge": "Trasladar la identidad de una marca de indumentaria a una plataforma digital personalizada que fuera visualmente dinámica pero liviana y funcional.",
      "solution": "Mediante una escucha activa de los requerimientos del cliente, bajé conceptos creativos a una interfaz fluida. Prioricé un desarrollo libre de recursos pesados para no saturar al usuario, logrando que la estética de la marca conviva con una navegación ágil.",
      "impact": "Una tienda online con diseño de autor que potencia la imagen de marca y ofrece una experiencia de compra premium, demostrando que la alta calidad estética puede complementarse con la eficiencia técnica.",
      "technologies": [
        "PHP",
        "MySQL",
        "HTML5",
        "CSS3",
        "JavaScript",
        "React",
        "Redux",
        "React Router",
        "Vite",
        "Tailwind CSS",
        "Bootstrap",
        "Material UI",
        "Axios"
      ],
      "url": "https://avignonstore.com/ruta_de_prueba",
      "github": "proyecto privado",
      "images": []
    },
    {
      "id": 4,
      "name": "IPunto",
      "subtitle": "Sistema de Gestión de Inventarios",
      "short_description": "Digitalización de procesos y control preventivo de stock.",
      "description": "Herramienta de gestión enfocada en la automatización del control de stock y ventas para el sector minorista. El sistema reemplaza los registros manuales por un flujo digital con alertas inteligentes de stock, permitiendo una administración profesional del negocio y una visibilidad clara de los movimientos de mercadería.",
      "challenge": "Transformar la gestión manual de vendedores minoristas en un proceso automatizado para eliminar errores de carga y falta de previsión en el stock",
      "solution": "Diseñé un sistema de alertas visuales inteligentes que notifican niveles críticos de inventario antes de que ocurra el quiebre de stock. Implementé una lógica de validación de datos rigurosa que impide ingresos erróneos, adaptando la complejidad técnica a una interfaz sencilla para usuarios no habituados al software.",
      "impact": "Reducción del 40% en errores manuales de inventario y una optimización total de los tiempos de carga, logrando que el control del negocio sea predecible y profesional.",
      "technologies": [
        "Node.js",
        "Express",
        "MongoDB",
        "Mongoose",
        "JavaScript",
        "React",
        "Redux",
        "React Router",
        "Vite",
        "Tailwind CSS",
        "Material UI",
        "Axios",
        "Cloudinary",
        "JWT",
        "SweetAlert2",
        "Zod"
      ],
      "url": "https://youtu.be/sUDWXduWUtU",
      "github": "https://github.com/mvirm/iPunto",
      "images": []
    }
  ]
}
